src/Catalogs/ПараметрыРасчетовДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ПараметрыРасчетовДоставки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйЗапрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадаватьЗначениеПриРасчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПериодыОтбораДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДатаГраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДатыГраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГраницыПериода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыГраницПериода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодСмещения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодСдвиг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыГраницПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыГраницПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачалоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонецПериода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПараметрыРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ПараметрыРасчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйЗапрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадаватьЗначениеПриРасчетеЗП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПериодыОтбораДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДатаГраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДатыГраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГраницыПериода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыГраницПериода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодСмещения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодСдвиг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПараметрыРасчетовДоставки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.ЗадаватьЗначениеПриРасчете = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ИмяИсточника) Тогда
		
		ВидИсточникаПоМетаданным = Лев(Объект.ИмяИсточника, СтрНайти(Объект.ИмяИсточника,".")-1);
		
		ТаблицаИсточника = СтрЗаменить(Объект.ИмяИсточника, ВидИсточникаПоМетаданным + "." , "");
		
		Сч = СтрНайти(ТаблицаИсточника,".");
		
		Если Сч > 0 Тогда	
			ИмяИсточникаПоМетаданным = Лев(ТаблицаИсточника, Сч - 1);
		ИначеЕсли СтрНайти(Объект.ПредставлениеИсточника, "движения:") > 0 Тогда
			ИмяИсточникаПоМетаданным = ТаблицаИсточника;
		Иначе
			ИмяИсточникаПоМетаданным = ТаблицаИсточника;
		КонецЕсли;
		
		МетаданныеИсточник = Метаданные[СтрЗаменить(ВидИсточникаПоМетаданным, "Регистр", "Регистры")][ИмяИсточникаПоМетаданным];
		
		ИнициализироватьОтбор(МетаданныеИсточник);
		
		УстановитьОтбор();
		
	КонецЕсли;
	
	ДоступныПроизвольныеЗапросы = НЕ ОбщегоНазначения.РазделениеВключено();
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриОткрытии формы.
//
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ПередЗаписьюНаСервере формы.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроверкаНаДублированиеИдентификатора(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
    
    Если НЕ Объект.ЗадаватьЗначениеПриРасчете И НЕ Объект.ПроизвольныйЗапрос Тогда

        Отказ = ПроверкаНаВыборПоказателя();
 		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	
		СформироватьЗапросЗаполнитьПараметры();

	ИначеЕсли НЕ Объект.ЗадаватьЗначениеПриРасчете И Объект.ПроизвольныйЗапрос Тогда

        Отказ = НЕ ЗапросКорректный();

	КонецЕсли;   
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Оповестить("Запись_ПараметрыРасчетовДоставки", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ИсточникНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ПараметрыРасчетовДоставки.Форма.ФормаВыбораИсточника", , , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникНачалоВыбораЗавершение(СтруктураВыбора,Параметры) Экспорт
	
	Если СтруктураВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.ПроизвольныйЗапрос		= Ложь;
	Объект.ИмяИсточника				= СтруктураВыбора.Источник;
	Объект.ПредставлениеИсточника	= СтруктураВыбора.ПредставлениеПоля;
	
	Объект.Показатели.Очистить();
	Объект.ПериодыОтбораДанных.Очистить();
	Объект.ПараметрыЗапроса.Очистить();
	
	Объект.Запрос = "";
	
	ЗаполнитьПоказателиИПериодыОтбораДанныхИсточника();
	СформироватьЗапросЗаполнитьПараметры();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияЗапросаКонструктором(ТекстЗапросаИзКонструктора, ДополнительныеПараметры) Экспорт
	
	Если ТекстЗапросаИзКонструктора <> Неопределено
		И НЕ ПустаяСтрока(ТекстЗапросаИзКонструктора) Тогда
		
		Объект.Запрос = ТекстЗапросаИзКонструктора;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКИсходномуЗапросу(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.Запрос = ТекстЗапроса;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля Наименование.
//
Процедура НаименованиеПриИзменении(Элемент)
     
    ПолучитьИдентификатор(Объект.Наименование);

КонецПроцедуры // НаименованиеПриИзменении()

&НаКлиенте
Процедура ЗадаватьЗначениеПриРасчетеПриИзменении(Элемент)

	Если Объект.ЗадаватьЗначениеПриРасчете Тогда

		ТекстСообщения = НСтр("ru = 'После установки флага все реквизиты будут очищены. Продолжить?'");

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗадаватьЗначениеПриРасчетеПриИзмененииЗавершение", ЭтотОбъект),
			ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Возврат;

	КонецЕсли;

	ЗадаватьЗначениеПриРасчетеПриИзмененииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗадаватьЗначениеПриРасчетеПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	РезультатВопроса = Результат;
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Объект.ЗадаватьЗначениеПриРасчете = Ложь;
		Возврат;
	КонецЕсли;

	Объект.ИмяИсточника = "";
	Объект.ПредставлениеИсточника = "";
	Объект.Запрос = "";
	Объект.ПроизвольныйЗапрос = Ложь;
	Объект.ПериодыОтбораДанных.Очистить();
	Объект.Показатели.Очистить();
	Объект.ПараметрыЗапроса.Очистить();
	ЗадаватьЗначениеПриРасчетеПриИзмененииФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗадаватьЗначениеПриРасчетеПриИзмененииФрагмент()
    
    УправлениеФормой();

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ПроизвольныйЗапрос.
//
Процедура ПроизвольныйЗапросПриИзменении(Элемент)

	Если Объект.ПроизвольныйЗапрос Тогда
		
		Объект.ИмяИсточника				= "";
		Объект.ПредставлениеИсточника	= "";
		
		Объект.ПериодыОтбораДанных.Очистить();
		Объект.Показатели.Очистить();
		ОтборДанных.Настройки.Отбор.Элементы.Очистить();
		
	Иначе
		
		Объект.Запрос					= "";
		Объект.ПараметрыЗапроса.Очистить();
		
	КонецЕсли; 
	
	УправлениеФормой();
	
КонецПроцедуры // ПроизвольныйЗапросПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ПроизвольныйЗапрос.
//
Процедура ПоказателиИспользованиеПриИзменении(Элемент)
	                                      
	Если Элементы.Показатели.ТекущиеДанные.Использование Тогда
		Для каждого СтрокаТЧ Из Объект.Показатели Цикл
            Если СтрокаТЧ <> Элементы.Показатели.ТекущиеДанные Тогда
				СтрокаТЧ.Использование = Ложь;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры // ИспользованиеПриИзменении()

#Область ТабличныеЧасти

&НаКлиенте
// Процедура - обработчик события ПриОкончанииРедактирования таблицы Отбор.
//
Процедура ОтборДанныхНастройкиОтборПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ Объект.ПроизвольныйЗапрос Тогда
		СформироватьЗапросЗаполнитьПараметры();
	КонецЕсли;

КонецПроцедуры // ОтборПриОкончанииРедактирования()

&НаКлиенте
// Процедура - обработчик события ПриОкончанииРедактирования таблицы Показатели.
//
Процедура ПоказателиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ Объект.ПроизвольныйЗапрос Тогда
		СформироватьЗапросЗаполнитьПараметры();
	КонецЕсли;

КонецПроцедуры // ПоказателиПриОкончанииРедактирования()

&НаКлиенте
// Процедура - обработчик события ПослеУдаления таблицы Отбор.
//
Процедура ОтборДанныхНастройкиОтборПослеУдаления(Элемент)
	
	Если НЕ Объект.ПроизвольныйЗапрос Тогда
		СформироватьЗапросЗаполнитьПараметры();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события Очистка поля Источник.
//
Процедура ИсточникОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ИмяИсточника 			= "";
	Объект.ПредставлениеИсточника	= "";
	Объект.Запрос					= "";
	
	Объект.ПериодыОтбораДанных.Очистить();
	Объект.Показатели.Очистить();	
	Объект.ПараметрыЗапроса.Очистить();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПередНачаломДобавления таблицы Показатели.
//
Процедура ПоказателиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПередНачаломДобавления таблицы ПериодыОтбораДанных.
//
Процедура ПериодыОтбораДанныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПередНачаломДобавления таблицы ПараметрыЗапроса.
//
Процедура ПараметрыЗапросаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область ОбработчикиКомандФормы

#Если НЕ МобильныйКлиент Тогда
     	
&НаКлиенте
// Процедура - обработчик нажатия на кнопку КонструкторЗапроса.
//
Процедура КонструкторЗапроса(Команда)
	
	КонструкторЗапроса = Новый КонструкторЗапроса;
	
	Если Объект.Запрос <> "" Тогда
		
		КонструкторЗапроса.Текст = Объект.Запрос;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеРедактированияЗапросаКонструктором", ЭтотОбъект);
	КонструкторЗапроса.Показать(ОписаниеОповещения);	
	
КонецПроцедуры // КонструкторЗапроса()

#КонецЕсли  

&НаКлиенте
// Процедура - обработчик события Выполнить поля РедактироватьЗапрос.
//
Процедура РедактироватьЗапрос(Команда)
	
	Если Элементы.РедактироватьЗапрос.Пометка Тогда
		
		ЗапросКорректный = ЗапросКорректный();
		Если ЗапросКорректный Тогда
			
			ЗаполнитьПараметрыПоЗапросу();
			
		Иначе
			
			ТекстВопроса = НСтр("ru = 'Запрос содержит ошибку! 
				|Очистить запрос и вернуться к исходному?'");
				
			ПоказатьВопрос(Новый ОписаниеОповещения("ВернутьсяКИсходномуЗапросу", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		ТекстЗапроса = Объект.Запрос; // запомним текст запроса перед редактированием
		
	КонецЕсли;
	
	Элементы.РедактироватьЗапрос.Пометка = НЕ Элементы.РедактироватьЗапрос.Пометка;
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область УправлениеВнешнимВидомФорм

&НаСервере
// Процедура заполняет показатели и периоды отбора данных регистра.
//
Процедура ЗаполнитьПоказателиИПериодыОтбораДанныхИсточника()

	ВидИсточникаПоМетаданным = Лев(Объект.ИмяИсточника, СтрНайти(Объект.ИмяИсточника,".")-1);

	ТаблицаИсточника = СтрЗаменить(Объект.ИмяИсточника, ВидИсточникаПоМетаданным + "." , "");
	
    Периодический = Истина;
	Сч = СтрНайти(ТаблицаИсточника,".");
	
	Если Сч > 0 Тогда	
		ИмяИсточникаПоМетаданным = Лев(ТаблицаИсточника, Сч - 1);

	ИначеЕсли СтрНайти(Объект.ПредставлениеИсточника, "движения:") > 0 Тогда
		ИмяИсточникаПоМетаданным = ТаблицаИсточника;

	Иначе
		ИмяИсточникаПоМетаданным = ТаблицаИсточника;
		Периодический = Ложь;  
			
	КонецЕсли;

    МетаданныеИсточник = Метаданные[СтрЗаменить(ВидИсточникаПоМетаданным, "Регистр", "Регистры")][ИмяИсточникаПоМетаданным];

    Для каждого Ресурс Из МетаданныеИсточник.Ресурсы Цикл

		// 1. Регистр накопления.
		Если СтрНайти(Объект.ИмяИсточника, "РегистрНакопления")>0 Тогда

			Если СтрНайти(Объект.ПредставлениеИсточника,": обороты")  Тогда

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление 	= Ресурс.Синоним + ": оборот";
				НовыйПоказатель.Имя 			= Ресурс.Имя + "Оборот";
				НовыйПоказатель.Использование 	= Ложь;

			ИначеЕсли СтрНайти(Объект.ПредставлениеИсточника, ": остатки и обороты") > 0 Тогда

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление 	= Ресурс.Синоним + ": начальный остаток";
				НовыйПоказатель.Имя 			= Ресурс.Имя + "НачальныйОстаток";
				НовыйПоказатель.Использование 	= Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление 	= Ресурс.Синоним + ": приход";
				НовыйПоказатель.Имя 			= Ресурс.Имя + "Приход";
				НовыйПоказатель.Использование 	= Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление 	= Ресурс.Синоним + ": оборот";
				НовыйПоказатель.Имя 			= Ресурс.Имя + "Оборот";
				НовыйПоказатель.Использование 	= Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление 	= Ресурс.Синоним + ": расход";
				НовыйПоказатель.Имя				= Ресурс.Имя + "Расход";
				НовыйПоказатель.Использование	= Ложь;
                 
				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление	= Ресурс.Синоним + ": конечный остаток";
				НовыйПоказатель.Имя				= Ресурс.Имя + "КонечныйОстаток";
				НовыйПоказатель.Использование	= Ложь;

			ИначеЕсли СтрНайти(Объект.ПредставлениеИсточника, ": остатки") > 0 Тогда

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление	= Ресурс.Синоним + ": остаток";
				НовыйПоказатель.Имя				= Ресурс.Имя + "Остаток";
				НовыйПоказатель.Использование	= Ложь;
				
			ИначеЕсли СтрНайти(Объект.ПредставлениеИсточника, "движения: приход") > 0 Тогда
				
				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление	= Ресурс.Синоним + ": приход";
				НовыйПоказатель.Имя				= Ресурс.Имя;
				НовыйПоказатель.Использование	= Ложь;
				
			ИначеЕсли СтрНайти(Объект.ПредставлениеИсточника, "движения: расход") > 0 Тогда
				
				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление 	= Ресурс.Синоним + ": расход";
				НовыйПоказатель.Имя				= Ресурс.Имя;
				НовыйПоказатель.Использование	= Ложь;
				
			ИначеЕсли СтрНайти(Объект.ПредставлениеИсточника, "движения: оборот") > 0 Тогда
				
				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление 	= Ресурс.Синоним + ": оборот";
				НовыйПоказатель.Имя				= Ресурс.Имя;
				НовыйПоказатель.Использование	= Ложь;
							
			КонецЕсли;

		// 2. Регистр сведений.
		ИначеЕсли СтрНайти(Объект.ИмяИсточника, "РегистрСведений") > 0 Тогда

			ТипыРесурса = Ресурс.Тип.Типы();

			Если ТипыРесурса.Количество() = 1 И ТипыРесурса[0] = Тип("Число") Тогда

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление	= Ресурс.Синоним;
				НовыйПоказатель.Имя				= Ресурс.Имя;
				НовыйПоказатель.Использование	= Ложь;

			КонецЕсли;

		// 3. Регистр бухгалтерии.	
        ИначеЕсли СтрНайти(Объект.ИмяИсточника,"РегистрБухгалтерии") > 0 Тогда

			Если СтрНайти(Объект.ПредставлениеИсточника,": обороты с корреспонденцией") > 0  Тогда
											
				Если НЕ Ресурс.ПризнакУчета = Неопределено Тогда
					
					НовыйПоказатель = Объект.Показатели.Добавить();
					НовыйПоказатель.Представление = Ресурс.Имя + ": оборот Дт";
					НовыйПоказатель.Имя = Ресурс.Имя + "ОборотДт";
					НовыйПоказатель.Использование = Ложь;
					
					НовыйПоказатель = Объект.Показатели.Добавить();
					НовыйПоказатель.Представление = Ресурс.Имя + ": оборот Кт";
					НовыйПоказатель.Имя = Ресурс.Имя + "ОборотКт";
					НовыйПоказатель.Использование = Ложь;
					
				Иначе
					
				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": оборот";
				НовыйПоказатель.Имя = Ресурс.Имя + "Оборот";
				НовыйПоказатель.Использование = Ложь;
		
				КонецЕсли;

			ИначеЕсли СтрНайти(Объект.ПредставлениеИсточника,": остатки и обороты") > 0 Тогда

                НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": конечный остаток";
				НовыйПоказатель.Имя = Ресурс.Имя + "КонечныйОстаток";
				НовыйПоказатель.Использование = Ложь;

                НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": конечный остаток Дт";
				НовыйПоказатель.Имя = Ресурс.Имя + "КонечныйОстатокДт";
				НовыйПоказатель.Использование = Ложь;

                НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": конечный остаток Кт";
				НовыйПоказатель.Имя = Ресурс.Имя + "КонечныйОстатокКт";
				НовыйПоказатель.Использование = Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": конечный развернутый остаток Дт";
				НовыйПоказатель.Имя = Ресурс.Имя + "КонечныйРазвернутыйОстатокДт";
				НовыйПоказатель.Использование = Ложь;

                НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": конечный развернутый остаток Кт";
				НовыйПоказатель.Имя = Ресурс.Имя + "КонечныйРазвернутыйОстатокКт";
				НовыйПоказатель.Использование = Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": начальный остаток";
				НовыйПоказатель.Имя = Ресурс.Имя + "НачальныйОстаток";
				НовыйПоказатель.Использование = Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": начальный остаток Дт";
				НовыйПоказатель.Имя = Ресурс.Имя + "НачальныйОстатокДт";
				НовыйПоказатель.Использование = Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": начальный остаток Кт";
				НовыйПоказатель.Имя = Ресурс.Имя + "НачальныйОстатокКт";
				НовыйПоказатель.Использование = Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя+": начальный развернутый остаток Дт";
				НовыйПоказатель.Имя = Ресурс.Имя + "НачальныйРазвернутыйОстатокДт";
				НовыйПоказатель.Использование = Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": начальный развернутый остаток Кт";
				НовыйПоказатель.Имя = Ресурс.Имя + "НачальныйРазвернутыйОстатокКт";
				НовыйПоказатель.Использование = Ложь;
				
				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": оборот";
				НовыйПоказатель.Имя = Ресурс.Имя + "Оборот";
				НовыйПоказатель.Использование = Ложь;
				
				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": оборот Дт";
				НовыйПоказатель.Имя = Ресурс.Имя + "ОборотДт";
				НовыйПоказатель.Использование = Ложь;
				
				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": оборот Кт";
				НовыйПоказатель.Имя = Ресурс.Имя + "ОборотКт";
				НовыйПоказатель.Использование = Ложь;
                            			
			ИначеЕсли СтрНайти(Объект.ПредставлениеИсточника,": остатки") > 0 Тогда

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": остаток";
				НовыйПоказатель.Имя = Ресурс.Имя+"Остаток";
				НовыйПоказатель.Использование = Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": остаток Дт";
				НовыйПоказатель.Имя = Ресурс.Имя + "ОстатокДт";
				НовыйПоказатель.Использование = Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": остаток Кт";
				НовыйПоказатель.Имя = Ресурс.Имя + "ОстатокКт";
				НовыйПоказатель.Использование = Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": развернутый остаток Дт";
				НовыйПоказатель.Имя = Ресурс.Имя + "РазвернутыйОстатокДт";
				НовыйПоказатель.Использование = Ложь;

				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": развернутый остаток Кт";
				НовыйПоказатель.Имя = Ресурс.Имя + "РазвернутыйОстатокКт";
				НовыйПоказатель.Использование = Ложь;
				
			ИначеЕсли СтрНайти(Объект.ПредставлениеИсточника,": обороты") > 0 Тогда
				
				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": оборот";
				НовыйПоказатель.Имя = Ресурс.Имя + "Оборот";
				НовыйПоказатель.Использование = Ложь;
				
				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": оборот Дт";
				НовыйПоказатель.Имя = Ресурс.Имя + "ОборотДт";
				НовыйПоказатель.Использование = Ложь;
				
				НовыйПоказатель = Объект.Показатели.Добавить();
				НовыйПоказатель.Представление = Ресурс.Имя + ": оборот Кт";
				НовыйПоказатель.Имя = Ресурс.Имя + "ОборотКт";
				НовыйПоказатель.Использование = Ложь;
				
			ИначеЕсли СтрНайти(Объект.ПредставлениеИсточника,": движения с субконто") > 0 Тогда
				
				Если НЕ Ресурс.ПризнакУчета = Неопределено Тогда
					
					НовыйПоказатель = Объект.Показатели.Добавить();
					НовыйПоказатель.Представление = Ресурс.Имя + ": Дт";
					НовыйПоказатель.Имя = Ресурс.Имя + "Дт";
					НовыйПоказатель.Использование = Ложь;
					
					НовыйПоказатель = Объект.Показатели.Добавить();
					НовыйПоказатель.Представление = Ресурс.Имя + ": Кт";
					НовыйПоказатель.Имя = Ресурс.Имя + "Кт";
					НовыйПоказатель.Использование = Ложь;
					
				Иначе
					
					НовыйПоказатель = Объект.Показатели.Добавить();
					НовыйПоказатель.Представление = Ресурс.Имя;
					НовыйПоказатель.Имя = Ресурс.Имя;
					НовыйПоказатель.Использование = Ложь;
		
				КонецЕсли;
				
			КонецЕсли;
        			
      	КонецЕсли;
        
	КонецЦикла;

	Если Объект.Показатели.Количество() > 0 Тогда
		Объект.Показатели[0].Использование = Истина;
	КонецЕсли; 

    // 4. Периоды отбора данных.
	Если Периодический Тогда

		Если СтрНайти(Объект.ПредставлениеИсточника, "обороты") > 0 ИЛИ СтрНайти(Объект.ПредставлениеИсточника, "движения:") > 0 Тогда

			НоваяГраницаОтбора = Объект.ПериодыОтбораДанных.Добавить();
			НоваяГраницаОтбора.ИмяДатаГраницы			= "НачалоПериода";
			НоваяГраницаОтбора.ПредставлениеДатыГраницы	= "Дата начала отбора данных";
			НоваяГраницаОтбора.ТипГраницыПериода		= Перечисления.ТипыГраницПериода.НачалоПериода;

			НоваяГраницаОтбора = Объект.ПериодыОтбораДанных.Добавить();
			НоваяГраницаОтбора.ИмяДатаГраницы			= "КонецПериода";
			НоваяГраницаОтбора.ПредставлениеДатыГраницы = "Дата конца отбора данных";
			НоваяГраницаОтбора.ТипГраницыПериода		= Перечисления.ТипыГраницПериода.КонецПериода;

		Иначе

			НоваяГраницаОтбора = Объект.ПериодыОтбораДанных.Добавить();
			НоваяГраницаОтбора.ИмяДатаГраницы 			= "МоментВремени";
			НоваяГраницаОтбора.ПредставлениеДатыГраницы	= "Дата значения";
			НоваяГраницаОтбора.ТипГраницыПериода		= Перечисления.ТипыГраницПериода.НачалоПериода;

		КонецЕсли;

	КонецЕсли;
    	
	// 5. Отбор.
	ИнициализироватьОтбор(МетаданныеИсточник);
  	 
КонецПроцедуры // ЗаполнитьПоказателиИПериодыОтбораДанныхИсточника()

&НаСервере
// Процедура инициализирует отбор источника данных.
//
Процедура ИнициализироватьОтбор(МетаданныеИсточник)

	СхемаКомпоновки = Новый СхемаКомпоновкиДанных();		
		
	Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
	Источник.Имя = "Источник1";
	Источник.СтрокаСоединения="";
	Источник.ТипИсточникаДанных = "local";
	
	ТекстЗапроса = "ВЫБРАТЬ";
	ЗнчФлаг = Ложь;
	Для каждого Измерение Из МетаданныеИсточник.Измерения Цикл

		Если ЗнчФлаг Тогда

			ТекстЗапроса = 	ТекстЗапроса + ",
							| " + Измерение.Имя;

		Иначе
	
			ТекстЗапроса = 	ТекстЗапроса + "
							| " + Измерение.Имя;

		КонецЕсли;
	
		ЗнчФлаг = Истина;	
	
	КонецЦикла;

	ТекстЗапроса = 	ТекстЗапроса + " 
					|ИЗ " + Объект.ИмяИсточника;
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.Имя = "Запрос";
	НаборДанных.ИсточникДанных = "Источник1";
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВременногоХранилища);	
	ОтборДанных.Инициализировать(ИсточникНастроек);

КонецПроцедуры // ИнициализироватьОтбор()

&НаСервере
// Процедура устанавливает отбор.
//
Процедура УстановитьОтбор()

	Если Не Объект.ПроизвольныйЗапрос Тогда

		ОтборДанных.Настройки.Отбор.Элементы.Очистить();

		// Заполняем отбор.
		Для каждого СтрокаПараметров Из Объект.ПараметрыЗапроса Цикл

			Если СтрокаПараметров.Имя <> "МоментВремени"
				И СтрокаПараметров.Имя <> "НачалоПериода"
				И СтрокаПараметров.Имя <> "КонецПериода" Тогда

				ЭлементОтбора = ОтборДанных.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрокаПараметров.Имя);
				Если СтрокаПараметров.ВидСравнения = "" Тогда
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				Иначе
				    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных[СтрЗаменить(СтрокаПараметров.ВидСравнения," ","")];
				КонецЕсли; 
				ЭлементОтбора.ПравоеЗначение = СтрокаПараметров.Значение;

			КонецЕсли;

		КонецЦикла;			
	
	КонецЕсли;

КонецПроцедуры // УстановитьОтбор()

&НаКлиенте
Процедура УправлениеФормой()
	
	ПараметрПоИсточнику = НЕ ПустаяСтрока(Объект.ИмяИсточника);
	
	// Разделенным пользователям нельзя редактировать запрос
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Запрос", "ТолькоПросмотр",				НЕ ДоступныПроизвольныеЗапросы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПараметрыЗапроса", "ТолькоПросмотр",	НЕ ДоступныПроизвольныеЗапросы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроизвольныйЗапрос", "ТолькоПросмотр",	НЕ ДоступныПроизвольныеЗапросы);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Источник", "Доступность",				ДоступныПроизвольныеЗапросы И НЕ Объект.ПроизвольныйЗапрос);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроизвольныйЗапрос", "Доступность",		ДоступныПроизвольныеЗапросы И НЕ ПараметрПоИсточнику);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РедактироватьЗапрос", "Доступность",	Объект.ПроизвольныйЗапрос);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонструкторЗапроса", "Доступность",		Объект.ПроизвольныйЗапрос И Элементы.РедактироватьЗапрос.Пометка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Запрос", "Доступность",					Объект.ПроизвольныйЗапрос И Элементы.РедактироватьЗапрос.Пометка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПараметрыЗапроса", "Доступность",		Объект.ПроизвольныйЗапрос И НЕ Элементы.РедактироватьЗапрос.Пометка);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаДанные", "Видимость",			ПараметрПоИсточнику);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтбор", "Видимость",				ПараметрПоИсточнику);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗапрос", "Видимость",				ПараметрПоИсточнику ИЛИ Объект.ПроизвольныйЗапрос);
	
	РежимОтображенияСтраниц = ?(Объект.ПроизвольныйЗапрос, ОтображениеСтраницФормы.Нет, ОтображениеСтраницФормы.ЗакладкиСверху);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Страницы", "ОтображениеСтраниц",		РежимОтображенияСтраниц);
	
	ВидимаяСтраница = ?(Объект.ЗадаватьЗначениеПриРасчете, Элементы.ВидимостьВыключена, Элементы.ВидимостьВключена);
	Если Элементы.УправлениеВидимостью.ТекущаяСтраница<>ВидимаяСтраница Тогда
		Элементы.УправлениеВидимостью.ТекущаяСтраница = ВидимаяСтраница;
	КонецЕсли; 
	
	#Если МобильныйКлиент Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонструкторЗапроса", "Видимость", Ложь);
	#Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонструкторЗапроса", "Доступность", Объект.ПроизвольныйЗапрос И Элементы.РедактироватьЗапрос.Пометка);
	#КонецЕсли
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти 

#Область ОбщегоНазначения

&НаСервере
// Функция составляет строку условия для запроса
//
Функция ПолучитьВидСравнения(ИмяПоля, ВидСравненияОтбора)

	Если ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно  Тогда
		Возврат "Источник." + ИмяПоля + " = &" + СтрЗаменить(ИмяПоля, ".", "");

	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Больше Тогда
		Возврат "Источник." + ИмяПоля + " > &" + СтрЗаменить(ИмяПоля, ".", "");
	
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.БольшеИлиРавно  Тогда
		Возврат "Источник." + ИмяПоля + " >= &" + СтрЗаменить(ИмяПоля, ".", "");
	
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВИерархии 
		ИЛИ  ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
		Возврат "Источник." + ИмяПоля + " В ИЕРАРХИИ (&" + СтрЗаменить(ИмяПоля, ".", "") + ")";
	
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке  Тогда
		Возврат "Источник." + ИмяПоля + " В (&" + СтрЗаменить(ИмяПоля, ".", "") + ")";
	
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Меньше  Тогда
		Возврат "Источник." + ИмяПоля + " < &" + СтрЗаменить(ИмяПоля, ".", "");
	
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно  Тогда         
		Возврат "Источник." + ИмяПоля + " <= &" + СтрЗаменить(ИмяПоля, ".", "");
	
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеВСписке  Тогда
		Возврат "НЕ Источник." + ИмяПоля + " В (&" + СтрЗаменить(ИмяПоля, ".", "") + ")";
	
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеВИерархии 
		ИЛИ ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		Возврат "НЕ Источник." + ИмяПоля + " В ИЕРАРХИИ (&" + СтрЗаменить(ИмяПоля, ".", "") + ")";
	
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеРавно  Тогда
		Возврат "Источник." + ИмяПоля + " <> &" + СтрЗаменить(ИмяПоля, ".", "");
	
	КонецЕсли; 

КонецФункции // ()

&НаСервере
// Процедура открывает конструктор запроса.
//
Процедура СформироватьЗапросЗаполнитьПараметры()

	СписокПолей = "";
	Для каждого Поле Из Объект.Показатели Цикл
		Если Поле.Использование Тогда
			СписокПолей = СписокПолей + ?(СписокПолей = "", "", ",
 																	|     ") + "СУММА(Источник." + Поле.Имя + ")";
		КонецЕсли; 
	КонецЦикла; 

    СписокУсловий = "";
	Для каждого ЭлементОтбора Из ОтборДанных.Настройки.Отбор.Элементы Цикл
		СписокУсловий = СписокУсловий + ?(СписокУсловий = "", "", "
																	|	И ") + ПолучитьВидСравнения(ЭлементОтбора.ЛевоеЗначение, ЭлементОтбора.ВидСравнения);
	КонецЦикла;

    ТекстЗапроса = "ВЫБРАТЬ 
					|	"+ СписокПолей + "
					|ИЗ 
					|	"+ Объект.ИмяИсточника + " КАК Источник" + ?(СписокУсловий = "", "", "
					|ГДЕ 
					|	"+ СписокУсловий);
    
	Объект.Запрос = ТекстЗапроса;

	Объект.ПараметрыЗапроса.Очистить();

	Для каждого СтрокаТЧ Из Объект.ПериодыОтбораДанных Цикл
		Если Объект.ПараметрыЗапроса.НайтиСтроки(Новый Структура("Имя", СтрокаТЧ.ИмяДатаГраницы)).Количество() = 0 Тогда
			НоваяСтрока = Объект.ПараметрыЗапроса.Добавить();
			НоваяСтрока.Имя = СтрокаТЧ.ИмяДатаГраницы;
			НоваяСтрока.Представление = СтрокаТЧ.ИмяДатаГраницы;
			НоваяСтрока.Значение = СтрокаТЧ.Период;
		КонецЕсли; 
	КонецЦикла;
		 
	Для каждого ЭлементОтбора Из ОтборДанных.Настройки.Отбор.Элементы Цикл
		Если Объект.ПараметрыЗапроса.НайтиСтроки(Новый Структура("Имя", Строка(ЭлементОтбора.ЛевоеЗначение))).Количество() = 0 Тогда
			НоваяСтрока = Объект.ПараметрыЗапроса.Добавить();
			НоваяСтрока.Имя = ЭлементОтбора.ЛевоеЗначение;
			НоваяСтрока.Представление = ЭлементОтбора.ЛевоеЗначение;
			НоваяСтрока.ВидСравнения = ЭлементОтбора.ВидСравнения;
			НоваяСтрока.Значение = ЭлементОтбора.ПравоеЗначение;
		КонецЕсли; 
	КонецЦикла;
                                                                  
КонецПроцедуры

&НаСервере
// Функция заполняет список параметров по тексту запроса
//
Процедура ЗаполнитьПараметрыПоЗапросу()
	
	Объект.ПараметрыЗапроса.Очистить();
	ЗапросСтрока = Объект.Запрос;
	НомерПодстроки = СтрНайти(ЗапросСтрока, "&");
	Пока НомерПодстроки > 0 Цикл
		
		ЗапросСтрока = Прав(ЗапросСтрока, (СтрДлина(ЗапросСтрока)-НомерПодстроки));
		
		НомерЗапятой = СтрНайти(ЗапросСтрока, ",");
		НомерПробела = СтрНайти(ЗапросСтрока, " ");
		НомерПС	 = СтрНайти(ЗапросСтрока, Символы.ПС);
		НомерСкобки	 = СтрНайти(ЗапросСтрока, ")");
		Если НомерЗапятой = 0 И НомерПробела = 0 И НомерПС = 0 И НомерСкобки = 0 Тогда
			ИмяПараметра = ЗапросСтрока;
		Иначе
			Если НомерЗапятой = 0 Тогда
				НомерЗапятой = 9000000;
			КонецЕсли; 
			Если НомерПробела = 0 Тогда
				НомерПробела = 9000000;
			КонецЕсли;
			Если НомерПС = 0 Тогда
				НомерПС = 9000000;
			КонецЕсли;
			Если НомерСкобки = 0 Тогда
				НомерСкобки = 9000000;
			КонецЕсли;
			КонецПараметра = МИН(НомерЗапятой, НомерПробела, НомерПС, НомерСкобки);
			ИмяПараметра = Лев(ЗапросСтрока, КонецПараметра - 1);
		КонецЕсли;
		
		Если Объект.ПараметрыЗапроса.НайтиСтроки(Новый Структура("Имя", ИмяПараметра)).Количество() = 0 Тогда
			НоваяСтрока = Объект.ПараметрыЗапроса.Добавить();
			НоваяСтрока.Имя = ИмяПараметра;
			НоваяСтрока.Представление = ИмяПараметра;
		КонецЕсли;
		
		НомерПодстроки = СтрНайти(ЗапросСтрока, "&");
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПараметрыПоЗапросу()

&НаСервере
// Функция проверяет корректность запроса.
//
Функция ЗапросКорректный()
	
	Если ПустаяСтрока(Объект.Запрос) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Попытка
		
		ПостроительЗапроса = Новый ПостроительЗапроса;
		ПостроительЗапроса.Текст = Объект.Запрос;
		ПостроительЗапроса.ЗаполнитьНастройки();
		
		Если ПостроительЗапроса.Измерения.Количество() > 0 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Запрос не должен содержать итоги!'");
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли; 
		
		Если ПостроительЗапроса.ВыбранныеПоля.Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Запрос должен содержать не более одного показателя!'");
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Истина;
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции // ПроверкаЗапроса()

&НаКлиенте
Процедура ПолучитьИдентификатор(СтрНаименование)

	Разделители     =  " .,+,-,/,*,?,=,<,>,(,)%!@#$%&*""№:;{}[]?()\|/`~'^_";

	Объект.Идентификатор = "";
	БылСпецСимвол = Ложь;
	Для НомСимвола = 1 По СтрДлина(СтрНаименование) Цикл
		Символ = Сред(СтрНаименование, НомСимвола, 1);
		Если СтрНайти(Разделители, Символ) <> 0 Тогда
			БылСпецСимвол = Истина;
		ИначеЕсли БылСпецСимвол Тогда
			БылСпецСимвол = Ложь;
			Объект.Идентификатор = Объект.Идентификатор + ВРег(Символ);
		Иначе
			Объект.Идентификатор = Объект.Идентификатор + Символ;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПроверкаНаДублированиеИдентификатора(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|     ПараметрыРасчетов.Идентификатор
	|ИЗ
	|     Справочник.ПараметрыРасчетов КАК ПараметрыРасчетов
	|ГДЕ
	|     ПараметрыРасчетов.Идентификатор = &Идентификатор
	|     И ПараметрыРасчетов.Ссылка <> &Ссылка";

	Запрос.УстановитьПараметр("Идентификатор", Объект.Идентификатор);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Отказ = Выборка.Количество() > 0;

	Если Отказ Тогда

		ТекстОшибки = НСтр("ru = 'Параметр расчета с таким наименованием уже существует.
						   |Измените наименование параметра'");

		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.Наименование");

	КонецЕсли;

	Возврат Отказ;

КонецФункции

&НаСервере
// Функция проверяет, выбран ли показатель.
//
Функция ПроверкаНаВыборПоказателя()

	Для каждого СтрокаТЧ Из Объект.Показатели Цикл
		Если СтрокаТЧ.Использование Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 
	 
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = НСтр("ru = 'Не выбран показатель!'");
	Сообщение.Сообщить();

	Возврат Истина;
     
КонецФункции // ПроверкаНаВыборПоказателя()

#КонецОбласти 

#КонецОбласти
